Revit 2027 API
TransactWithCentralOptions.GetLockCallback Method
 Gets the callback object that changes Revit's default behavior of endlessly waiting and repeatedly trying to lock a central model.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ICentralLockedCallback GetLockCallback()
Public Function GetLockCallback As ICentralLockedCallback
public:
ICentralLockedCallback^ GetLockCallback()
member GetLockCallback : unit -> ICentralLockedCallback
Return Value
ICentralLockedCallback
See Also
Reference
TransactWithCentralOptions Class
Autodesk.Revit.DB Namespace